# Тема 7 Работа с файлами (ввод, вывод)
Отчет по Теме #7 выполнил(а):
+ Тимашева Алина Андреевна
+ ИВТ-22-2

| Задание | Лаб_раб | Сам_раб |
|--------:|---------|---------|
|Задание 1|+        |+        |
|Задание 2|+        |+        |
|Задание 3|+        |+        |
|Задание 4|+        |+        |
|Задание 5|+        |+        |
|Задание 6|+        |-        |
|Задание 7|+        |-        |
|Задание 8|+        |-        |
|Задание 9|+        |-        |
|Задание 10|+       |-        |

знак "+" - задание выполнено; знак "-" - задание не выполнено;

Работу проверили:
+ к.э.н., доцент Панов М.А.

## Лабораторная работа №1
### 
Составьте текстовый файл и положите его в одну директорию с программой на Python. Текстовый файл должен состоять минимум из двух строк.

### Результат.

## Выводы


## Лабораторная работа №2
### 
Напишите программу, которая выведет только первую строку из вашего файла, при этом используйте конструкцию open()/close().

```python
f = open('input.txt', 'r')
print(f.readline())
f.close()
```

### Результат.

## Выводы

## Лабораторная работа №3
### 
Напишите программу, которая выведет все строки из вашего файла в массиве, при этом используйте конструкцию open()/close().

```python
import codecs

f = open('input.txt', 'r', encoding='utf-8')
print(f.readlines())
f.close()
```

### Результат.

## Выводы

  
## Лабораторная работа №4
### 
Напишите программу, которая выведет все строки из вашего файла в массиве, при этом используйте конструкцию with open().

```python
import codecs

with open('input.txt', encoding='utf-8') as f:
    for line in f:
        print(line)
```

### Результат.

## Выводы


## Лабораторная работа №5
### 
Напишите программу, которая выведет каждую строку из вашего файла отдельно, при этом используйте конструкцию with open().

```python
import codecs

with open('input.txt', encoding='utf-8') as f:
    print(f.readlines())
```

### Результат.

## Выводы


## Лабораторная работа №6
### 
Напишите программу, которая будет добавлять новую строку в ваш файл, а потом выведет полученный файл в консоль. Вывод можно осуществлять любым способом. Обязательно проверьте сам файл, чтобы изменения в нем тоже отображались.

```python
import codecs

with open('input.txt', 'a+', encoding='utf-8') as f:
    f.write('\nIm additional line')

with open('input.txt', 'r', encoding='utf-8') as f:
    result = f.readlines()
    print(result)
```

### Результат.

## Выводы


## Лабораторная работа №7
### 
Напишите программу, которая перепишет всю информацию, которая была у вас в файле до этого, например напишет любые данные из произвольно вами составленного списка. Также не забудьте проверить что измененная вами информация сохранилась в файле.

```python
import codecs

lines = ['one', 'two', 'three']
with open('input.txt', 'w', encoding='utf-8') as f:
    for line in lines:
        f.write('\nCycle run' + line)
    print('Done!')
```

### Результат.

## Выводы


## Лабораторная работа №8
### 
Выберите любую папку на своем компьютере, имеющую вложенные директории. Выведите на печать в терминал ее содержимое, как и всех подкаталогов при помощи функции print_docs(directory).

```python
import os
from traceback import print_exc


def print_docs (directory):
    all_files = os.walk(directory)
    for catalog in all_files:
        print('Папка {catalog[8]} содержит:')
        print (f' Директории: {", ".join([folder for folder in catalog[1]])}')
        print (f'Файлы: {", ".join([file for file in catalog[2]])}')
        print('-' * 40)

print_docs("/Users/46acf/eclipse")
```

### Результат.

## Выводы


## Лабораторная работа №9
### 
Документ «input.txt» содержит следующий текст:

Приветствие

Спасибо

Извините

Пожалуйста

До свидания

Ты готов?

Как дела?

С днем рождения!

Удача!

Я тебя люблю.


Требуется реализовать функцию, которая выводит слово, имеющее максимальную длину (или список слов, если таковых несколько). Проверьте работоспособность программы на своем наборе данных

```python
def longest_words(file):
    with open(file, encoding='utf-8') as f:
        words = f.read().split()
        max_length = len(max(words, key=len))
        for word in words:
            if len(word) == max_length:
                sought_words = word

        if len(sought_words) == 1:
            return sought_words[0]
        return sought_words

print(longest_words('input.txt'))
```

### Результат.

## Выводы


## Лабораторная работа №10
### 
Требуется создать csv-файл «rows_300.csv» со следующими столбцами: 
№ - номер по порядку (от 1 до 300); 
Секунда - текущая секунда на вашем ПК; 
Микросекунда текущая миллисекунда на часах.

Для наглядности на каждой итерации цикла искусственно приостанавливайте скрипт на 0,01 секунды. 

```python
import csv
import datetime
import time

with open('rows_300.csv', 'w', encoding='utf-8', newline='') as f:
    writer = csv.writer(f)
    writer.writerow(['N', 'Секунда, Микросекунда'])
    for line in range(1, 301):
        writer.writerow([line, datetime.datetime.now().second,
                         datetime.datetime.now().microsecond])
        time.sleep(0.01)
```

### Результат.

## Выводы


## Самостоятельная работа №1
### 


```python

```

### Результат.

## Выводы

## Самостоятельная работа №2
### 


```python

```

### Результат.

## Выводы

  
## Самостоятельная работа №3
### 


```python

```

### Результат.

## Выводы

  
## Самостоятельная работа №4
### 


```python

```

### Результат.

## Выводы

  
## Самостоятельная работа №5
### 


```python

```

### Результат.

## Выводы
